Revit 2026 API

# MasonryCMUMasonryCMUPatternMap Property

---

The property labeled "Image" from the "MasonryCMU" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MasonryCMUPatternMap { get; }
```
```vb
Public Shared ReadOnly Property MasonryCMUPatternMap As String
	Get
```
```cpp
public:
static property String^ MasonryCMUPatternMap {
	String^ get ();
}
```
```fsharp
static member MasonryCMUPatternMap : string with get
```

#### Property Value

String

This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.

#### Reference

MasonryCMU Class

Autodesk.Revit.DB.Visual Namespace